## Pandas
- used to analyse 2D or nnull data
-table like data
-they use numpy

In [2]:
%pip install pandas

Requirement already satisfied: pandas in c:\users\e1005292\onedrive - sanlam life insurance limited\documents\python basics\python_module\myenv\lib\site-packages (2.2.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\e1005292\onedrive - sanlam life insurance limited\documents\python basics\python_module\myenv\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\e1005292\onedrive - sanlam life insurance limited\documents\python basics\python_module\myenv\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: numpy<2,>=1.22.4 in c:\users\e1005292\onedrive - sanlam life insurance limited\documents\python basics\python_module\myenv\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: pytz>=2020.1 in c:\users\e1005292\onedrive - sanlam life insurance limited\documents\python basics\python_module\myenv\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: six>=1.5 in c:\users\e1005292\onedrive - sanlam life insurance limited\documents\python basics\python_module\myenv\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip available: 22.2.2 -> 24.0
[notice] To update, run: python.exe -m pip install --upgrade pip

## Creating data
- creating data from dictionaries
- and you can import from csv

final data is a data frame

In [3]:
import pandas as pd

pd

In [4]:
data = {
    'Name': ['John', 'Anna', 'Peter', 'Linda'],
    'Age': [28, 34, 29, 32],
    'City': ['New York', 'Paris', 'Berlin', 'London']
}
data

{'Name': ['John', 'Anna', 'Peter', 'Linda'],
 'Age': [28, 34, 29, 32],
 'City': ['New York', 'Paris', 'Berlin', 'London']}

## Making a dataframe from the data
- the 0, 1, 2 are the index of the values.
- the act as a primary key
- each column is a series

In [5]:
df = pd.DataFrame(data)
df

    Name  Age      City
0   John   28  New York
1   Anna   34     Paris
2  Peter   29    Berlin
3  Linda   32    London

## filtering the output
- note!! it is case sensitive

In [6]:
type(df)
type(df['Name'])
df['Name']

0     John
1     Anna
2    Peter
3    Linda
Name: Name, dtype: object

In sql 
- select name 
  from df

Filtering rows
- df.head(number od rows to return)

In [7]:
df.head(2)

   Name  Age      City
0  John   28  New York
1  Anna   34     Paris

### Info
- df.info()
- how many columns you have, 
- their data types
- null values

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    4 non-null      object
 1   Age     4 non-null      int64
 2   City    4 non-null      object
dtypes: int64(1), object(2)
memory usage: 224.0+ bytes

df.shape

-gives you the columns and rows the dataframe has

df.dtypes
- gives you the datatype of each column

df.columns
-gives you the column names

In [9]:
df.shape
df.dtypes
df.columns

Index(['Name', 'Age', 'City'], dtype='object')

df.describe
- gives information about the integers and floats
- gives you the mean and the median
- the average and std, max
- it does this for the whole table

df.describe(inlude('all'))
- give s youthe fell of integers plus all other rows

In [10]:
df.describe()  #only int and float colums
df.describe(include='all') #all the columns

        Name        Age      City
count      4   4.000000         4
unique     4        NaN         4
top     John        NaN  New York
freq       1        NaN         1
mean     NaN  30.750000       NaN
std      NaN   2.753785       NaN
min      NaN  28.000000       NaN
25%      NaN  28.750000       NaN
50%      NaN  30.500000       NaN
75%      NaN  32.500000       NaN
max      NaN  34.000000       NaN

CSV
- comma separated values
- comma separates columns

## Real world data
- reading from the csv file

In [11]:
tips_df = pd.read_csv('tips.csv')
tips_df

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [12]:
tips_df.describe()

       total_bill         tip        size
count  244.000000  244.000000  244.000000
mean    19.785943    2.998279    2.569672
std      8.902412    1.383638    0.951100
min      3.070000    1.000000    1.000000
25%     13.347500    2.000000    2.000000
50%     17.795000    2.900000    2.000000
75%     24.127500    3.562500    3.000000
max     50.810000   10.000000    6.000000

In [13]:
# Try to select day, day, tie

In [14]:
tips_df[['day','time', 'tip']].head(5)

   day    time   tip
0  Sun  Dinner  1.01
1  Sun  Dinner  1.66
2  Sun  Dinner  3.50
3  Sun  Dinner  3.31
4  Sun  Dinner  3.61

adding a new column
tips-def['new_column_name']

In [15]:
tips_df[['tip', 'size']].head(5)
tips_df['tips_per_person'] = tips_df['tip'] / tips_df['size']
tips_df.head(5)
tips_df.tail(10)

     total_bill   tip     sex smoker   day    time  size  tips_per_person
234       15.53  3.00    Male    Yes   Sat  Dinner     2         1.500000
235       10.07  1.25    Male     No   Sat  Dinner     2         0.625000
236       12.60  1.00    Male    Yes   Sat  Dinner     2         0.500000
237       32.83  1.17    Male    Yes   Sat  Dinner     2         0.585000
238       35.83  4.67  Female     No   Sat  Dinner     3         1.556667
239       29.03  5.92    Male     No   Sat  Dinner     3         1.973333
240       27.18  2.00  Female    Yes   Sat  Dinner     2         1.000000
241       22.67  2.00    Male    Yes   Sat  Dinner     2         1.000000
242       17.82  1.75    Male     No   Sat  Dinner     2         0.875000
243       18.78  3.00  Female     No  Thur  Dinner     2         1.500000

## find the percentage people are tipping
- add it as another column

In [16]:
tips_df['tip_percentage'] = ((tips_df['tip'] / tips_df['total_bill']) * 100).round(2)
# tips_df['tip_percentage'] = ((tips_df['tip'] / tips_df['total_bill']) * 100,2)  #sam as above
tips_df

,total_bill,tip,sex,smoker,day,time,size,tips_per_person,tip_percentage
0,16.99,1.01,Female,No,Sun,Dinner,2,0.505000,5.94
1,10.34,1.66,Male,No,Sun,Dinner,3,0.553333,16.05
2,21.01,3.50,Male,No,Sun,Dinner,3,1.166667,16.66
3,23.68,3.31,Male,No,Sun,Dinner,2,1.655000,13.98
4,24.59,3.61,Female,No,Sun,Dinner,4,0.902500,14.68
...,...,...,...,...,...,...,...,...,...
239,29.03,5.92,Male,No,Sat,Dinner,3,1.973333,20.39
240,27.18,2.00,Female,Yes,Sat,Dinner,2,1.000000,7.36
241,22.67,2.00,Male,Yes,Sat,Dinner,2,1.000000,8.82
242,17.82,1.75,Male,No,Sat,Dinner,2,0.875000,9.82
243,18.78,3.00,Female,No,Thur,Dinner,2,1.500000,15.97

## sorting
- tips_df.sort_values(by="Column_name", ascending=(true or false))

In [17]:
tips_df.sort_values(by='total_bill', ascending=False).head(5)

,total_bill,tip,sex,smoker,day,time,size,tips_per_person,tip_percentage
170,50.81,10.00,Male,Yes,Sat,Dinner,3,3.333333,19.68
212,48.33,9.00,Male,No,Sat,Dinner,4,2.250000,18.62
59,48.27,6.73,Male,No,Sat,Dinner,4,1.682500,13.94
156,48.17,5.00,Male,No,Sun,Dinner,6,0.833333,10.38
182,45.35,3.50,Male,Yes,Sun,Dinner,3,1.166667,7.72

## Filtering
- e.g find the rows where people went on sunday

In [18]:

tips_df[tips_df['day'] == "Sun"]

# tips_df[tips_df['day'] == "Sun"].shape[0]  #to get the rows count
# tips_df[tips_df['day'] == "Sun"].shape[1]  #to get the column count

,total_bill,tip,sex,smoker,day,time,size,tips_per_person,tip_percentage
0,16.99,1.01,Female,No,Sun,Dinner,2,0.505000,5.94
1,10.34,1.66,Male,No,Sun,Dinner,3,0.553333,16.05
2,21.01,3.50,Male,No,Sun,Dinner,3,1.166667,16.66
3,23.68,3.31,Male,No,Sun,Dinner,2,1.655000,13.98
4,24.59,3.61,Female,No,Sun,Dinner,4,0.902500,14.68
...,...,...,...,...,...,...,...,...,...
186,20.90,3.50,Female,Yes,Sun,Dinner,3,1.166667,16.75
187,30.46,2.00,Male,Yes,Sun,Dinner,5,0.400000,6.57
188,18.15,3.50,Female,Yes,Sun,Dinner,3,1.166667,19.28
189,23.10,4.00,Male,Yes,Sun,Dinner,3,1.333333,17.32
190,15.69,1.50,Male,Yes,Sun,Dinner,2,0.750000,9.56

## task 2
get rows where people tipped more than 3 on friday

# Values counts
tips_df = (tips_df['tips] > 3).value_count()  
- counts similar intems
- count the bool of how many are greater than 3

.value count
- groups the simalar items and gives you the count of the values

In [19]:
tips_df['day'].value_counts()

day
Sat     87
Sun     76
Thur    62
Fri     19
Name: count, dtype: int64

In [20]:
friday = tips_df[tips_df['day'] == "Fri"] 
friday[friday['tip'] > 3]

# selct * from tips-df where day = 'sun' and tip > 3

,total_bill,tip,sex,smoker,day,time,size,tips_per_person,tip_percentage
91,22.49,3.50,Male,No,Fri,Dinner,2,1.7500,15.56
93,16.32,4.30,Female,Yes,Fri,Dinner,2,2.1500,26.35
94,22.75,3.25,Female,No,Fri,Dinner,2,1.6250,14.29
95,40.17,4.73,Male,Yes,Fri,Dinner,4,1.1825,11.77
96,27.28,4.00,Male,Yes,Fri,Dinner,2,2.0000,14.66
221,13.42,3.48,Female,Yes,Fri,Lunch,2,1.7400,25.93

## task 3 :
Extend task 2 , top 5 tips on friday

In [21]:
friday_tips = tips_df[tips_df['day'] == "Fri"] 
friday_tips[friday_tips['tip'] > 3].sort_values(by='tip', ascending = False).head(5)

,total_bill,tip,sex,smoker,day,time,size,tips_per_person,tip_percentage
95,40.17,4.73,Male,Yes,Fri,Dinner,4,1.1825,11.77
93,16.32,4.30,Female,Yes,Fri,Dinner,2,2.1500,26.35
96,27.28,4.00,Male,Yes,Fri,Dinner,2,2.0000,14.66
91,22.49,3.50,Male,No,Fri,Dinner,2,1.7500,15.56
221,13.42,3.48,Female,Yes,Fri,Lunch,2,1.7400,25.93

## task 4 
large parties: if people are 5 or more or spend money more than 35
-Using or(|) and and(&)

In [22]:
tips_df[(tips_df['size'] >= 5) | (tips_df['total_bill'] >= 35)].sort_values(by='size')

,total_bill,tip,sex,smoker,day,time,size,tips_per_person,tip_percentage
184,40.55,3.00,Male,Yes,Sun,Dinner,2,1.500000,7.40
238,35.83,4.67,Female,No,Sat,Dinner,3,1.556667,13.03
102,44.30,2.50,Female,Yes,Sat,Dinner,3,0.833333,5.64
112,38.07,4.00,Male,No,Sun,Dinner,3,1.333333,10.51
182,45.35,3.50,Male,Yes,Sun,Dinner,3,1.166667,7.72
170,50.81,10.00,Male,Yes,Sat,Dinner,3,3.333333,19.68
212,48.33,9.00,Male,No,Sat,Dinner,4,2.250000,18.62
207,38.73,3.00,Male,Yes,Sat,Dinner,4,0.750000,7.75
197,43.11,5.00,Female,Yes,Thur,Lunch,4,1.250000,11.60
11,35.26,5.00,Female,No,Sun,Dinner,4,1.250000,14.18
95,40.17,4.73,Male,Yes,Fri,Dinner,4,1.182500,11.77
59,48.27,6.73,Male,No,Sat,Dinner,4,1.682500,13.94
56,38.01,3.00,Male,Yes,Sat,Dinner,4,0.750000,7.89
23,39.42,7.58,Male,No,Sat,Dinner,4,1.895000,19.23
216,28.15,3.00,Male,Yes,Sat,Dinner,5,0.600000,10.66
185,20.69,5.00,Male,No,Sun,Dinner,5,1.000000,24.17
187,30.46,2.00,Male,Yes,Sun,Dinner,5,0.400000,6.57
142,41.19,5.00,Male,No,Thur,Lunch,5,1.000000,12.14
155,29.85,5.14,Female,No,Sun,Dinner,5,1.028000,17.22
143,27.05,5.00,Female,No,Thur,Lunch,6,0.833333,18.48
156,48.17,5.00,Male,No,Sun,Dinner,6,0.833333,10.38
141,34.30,6.70,Male,No,Thur,Lunch,6,1.116667,19.53
125,29.80,4.20,Female,No,Thur,Lunch,6,0.700000,14.09

In [23]:
#dot syntax and box syntax
tips_df.smoker

0       No
1       No
2       No
3       No
4       No
      ...
239     No
240    Yes
241    Yes
242     No
243     No
Name: smoker, Length: 244, dtype: object

Data exploration
-giving valuable data to the company and meaningful data
- this might derive solutions

## summary
- filter rows and columns
- how to get limit using the head and Tail
- orderby using sort_values(by='')
- conditional with operation

## slicing in Pandas
- loc : match the value in the table not the row position (inclusive)
- iloc - based on the data, it matches the location of the value in the table(row position)(exclusive)

In [24]:
tips_df.head(6)

,total_bill,tip,sex,smoker,day,time,size,tips_per_person,tip_percentage
0,16.99,1.01,Female,No,Sun,Dinner,2,0.505000,5.94
1,10.34,1.66,Male,No,Sun,Dinner,3,0.553333,16.05
2,21.01,3.50,Male,No,Sun,Dinner,3,1.166667,16.66
3,23.68,3.31,Male,No,Sun,Dinner,2,1.655000,13.98
4,24.59,3.61,Female,No,Sun,Dinner,4,0.902500,14.68
5,25.29,4.71,Male,No,Sun,Dinner,4,1.177500,18.62

In [25]:
tips_df.iloc[3]  #returns the index specified
tips_df.iloc[3:5] #returns the 3rd and the 4th row
tips_df.iloc[3:5, 2:5]  #the values of the columns

      sex smoker  day
3    Male     No  Sun
4  Female     No  Sun

## loc
-locates the indexes/name specified

In [26]:
tips_df.loc[3]  #returns the index specified
tips_df.loc[3:5] #returns the 3rd and the 4th row and 5th 
tips_df.loc[3:5, 'tip'] #filter the columns, only return the tip column
tips_df.loc[3:5, 'tip' : 'day']  #returns the range of columns

    tip     sex smoker  day
3  3.31    Male     No  Sun
4  3.61  Female     No  Sun
5  4.71    Male     No  Sun

In [27]:
tips_df.tail(10).loc[235: 239]

,total_bill,tip,sex,smoker,day,time,size,tips_per_person,tip_percentage
235,10.07,1.25,Male,No,Sat,Dinner,2,0.625000,12.41
236,12.60,1.00,Male,Yes,Sat,Dinner,2,0.500000,7.94
237,32.83,1.17,Male,Yes,Sat,Dinner,2,0.585000,3.56
238,35.83,4.67,Female,No,Sat,Dinner,3,1.556667,13.03
239,29.03,5.92,Male,No,Sat,Dinner,3,1.973333,20.39

## task 1
- find the  rows with the highest tip_percentage and skip the fist 5 in the result on a weekend

In [28]:
# high_tips_on_weekends = tips_df[(tips_df['day'] == 'Sat') | (tips_df['day'] == 'Sun')].sort_values(by='tip', ascending=False).iloc[5:]
high_tips_on_weekends = tips_df[(tips_df['day'] == 'Sat') | (tips_df['day'] == 'Sun')].sort_values(by='tip', ascending=False)
high_tips_on_weekends

,total_bill,tip,sex,smoker,day,time,size,tips_per_person,tip_percentage
170,50.81,10.00,Male,Yes,Sat,Dinner,3,3.333333,19.68
212,48.33,9.00,Male,No,Sat,Dinner,4,2.250000,18.62
23,39.42,7.58,Male,No,Sat,Dinner,4,1.895000,19.23
59,48.27,6.73,Male,No,Sat,Dinner,4,1.682500,13.94
214,28.17,6.50,Female,Yes,Sat,Dinner,3,2.166667,23.07
...,...,...,...,...,...,...,...,...,...
215,12.90,1.10,Female,Yes,Sat,Dinner,2,0.550000,8.53
0,16.99,1.01,Female,No,Sun,Dinner,2,0.505000,5.94
67,3.07,1.00,Female,Yes,Sat,Dinner,1,1.000000,32.57
236,12.60,1.00,Male,Yes,Sat,Dinner,2,0.500000,7.94
111,7.25,1.00,Female,No,Sat,Dinner,1,1.000000,13.79

## task 2
final results should include only tip_percentage, tip, total_bill

In [29]:
high_tips_on_weekends.iloc[5:,[0,1,4,8]]
#or
# high_tips_on_weekends.iloc[5:,['total_bill','tip','day','tip_percentage']]

     total_bill   tip  day  tip_percentage
183       23.17  6.50  Sun           28.05
47        32.40  6.00  Sun           18.52
239       29.03  5.92  Sat           20.39
181       23.33  5.65  Sun           24.22
44        30.40  5.60  Sun           18.42
..          ...   ...  ...             ...
215       12.90  1.10  Sat            8.53
0         16.99  1.01  Sun            5.94
67         3.07  1.00  Sat           32.57
236       12.60  1.00  Sat            7.94
111        7.25  1.00  Sat           13.79

[158 rows x 4 columns]

##task 3
filter the rows fron the last 6 rows

In [30]:
tips_df.tail(6).loc[:,'tip':'day'].iloc[2:4]

     tip     sex smoker  day
240  2.0  Female    Yes  Sat
241  2.0    Male    Yes  Sat

# statistics
- mean
- median
- sum

In [31]:
tips_df['tip'].mean()
tips_df['tip'].median()
tips_df['tip'].sum()

# mean on multiple columns

tips_df[['total_bill', 'tip']].mean()
tips_df[['total_bill', 'tip']].median()
tips_df[['total_bill', 'tip']].mode()
tips_df[['total_bill', 'tip']].sum()

total_bill    4827.77
tip            731.58
dtype: float64

## task 1 
- average total bill in anyday
select *, avg(total_bill) 
from tips_df
group_by day
## groupby
- needs the group by column
- the column to use the aggregation on
- what aggregation are you using

In [33]:
tips_df.groupby("day").mean()

TypeError: agg function failed [how->mean,dtype->object]

In [ ]:
# Who leaves more tip, and smoker and non-smoker 
tips_df.groupby("smoker")['tip'].sum()

# On average who leaves more tips
tips_df.groupby("smoker")['tip'].mean()

# combine the two functions
tips_df.groupby("smoker").aggregate({'tip':'sum', 'total_bill': 'mean'})
tips_df.groupby("smoker").aggregate({'tip':['sum', 'mean'], 'total_bill': 'mean'})  #if you need to applay sum and mean in one column

           tip           total_bill
           sum      mean       mean
smoker
No      451.77  2.991854  19.188278
Yes     279.81  3.008710  20.756344

## Task:
- Based on the day calculate total of total_bill and on average what is tip_percent

In [ ]:
tips_df.groupby('day').aggregate({'total_bill': 'sum', 'tip_percentage': 'mean'})

      total_bill  tip_percentage
day
Fri       325.88       16.991579
Sat      1778.40       15.314598
Sun      1627.16       16.689605
Thur     1096.33       16.126452

## one more level of drilling
-we want to see how much they each tip per day
- group smokers and day.
- who gives tips more on each day

In [ ]:
tips_df.groupby(['smoker', 'day'])['tip'].mean()

smoker  day
No      Fri     2.812500
        Sat     3.102889
        Sun     3.167895
        Thur    2.673778
Yes     Fri     2.714000
        Sat     2.875476
        Sun     3.516842
        Thur    3.030000
Name: tip, dtype: float64

## task 
- on average who(male or female) earns more tips each day

In [ ]:
tips_df.groupby(['sex', 'day'])['tip'].mean()
tips_df.groupby(['day', 'sex'])['tip'].mean()

day   sex
Fri   Female    2.781111
      Male      2.693000
Sat   Female    2.801786
      Male      3.083898
Sun   Female    3.367222
      Male      3.220345
Thur  Female    2.575625
      Male      2.980333
Name: tip, dtype: float64

## unstack
transforms the results, therefore it is easier to analyze  (pull out the aggregate columns in to a separate columns)

In [ ]:
# Modified the above with stack
tips_df.groupby(['sex', 'day'])['tip'].mean().unstack()

day          Fri       Sat       Sun      Thur
sex
Female  2.781111  2.801786  3.367222  2.575625
Male    2.693000  3.083898  3.220345  2.980333

## Task
- on average, max, min who(male or female) earns more tips each day

In [30]:
tips_df.groupby(['sex', 'day']).aggregate({'tip': ['mean', 'max', 'min']})
tips_df.groupby(['day', 'sex']).aggregate({'tip': ['min', 'mean', 'max']}).unstack()

        tip
        min            mean              max
sex  Female  Male    Female      Male Female   Male
day
Fri    1.00  1.50  2.781111  2.693000   4.30   4.73
Sat    1.00  1.00  2.801786  3.083898   6.50  10.00
Sun    1.01  1.32  3.367222  3.220345   5.20   6.50
Thur   1.25  1.44  2.575625  2.980333   5.17   6.70

## Pivot tables

In [36]:
pd.pivot_table(tips_df,index='day', columns='smoker', values='tip', aggfunc='sum')

smoker      No     Yes
day
Fri      11.25   40.71
Sat     139.63  120.77
Sun     180.57   66.82
Thur    120.32   51.51

## visualize
- matplot
    - beginner friendly
    - pioneer
- seaborn
    - it uses matplot internally
    - complex visualization easily